Tekla.Structures.Model.Brep
The Brep class represents a single brep in the model.
A brep has a single start and end point.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Point point = new Point(0, 0, 0);
Point point2 = new Point(1000, 0, 0);
Brep brep = new Brep();
brep.StartPoint = point;
brep.EndPoint = point2;
brep.Profile = new Profile { ProfileString = "Default" };
bool result = brep.Insert();
}
}

Tekla.Structures.Model.Brep.StartPoint
Gets or sets the start point of the brep.

Tekla.Structures.Model.Brep.EndPoint
Gets or sets the end point of the brep.

Tekla.Structures.Model.Brep.StartPointOffset
Gets or sets the beam's start point offset.

Tekla.Structures.Model.Brep.EndPointOffset
Gets or sets the beam's end point offset.

Tekla.Structures.Model.Brep.#ctor
Initializes a new instance of the Tekla.Structures.Model.Brep class.
The start and end points are in the origin.

Tekla.Structures.Model.Brep.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Initializes a new instance of the Tekla.Structures.Model.Brep class with the given start and end points.
startPoint: The start point for the brep.
endPoint: The end point for the brep.

Tekla.Structures.Model.Brep.Insert
Inserts the brep into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.Brep.Select
Selects a brep from the model database. The brep identifier must be set.
Returns: True on success.

Tekla.Structures.Model.Brep.Modify
Modifies the existing brep in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.Brep.Delete
Deletes the brep instance with the given identifier from the model database.
Returns: True on success.